{
		"id": "oxygen",
		"bookname": "Oxygen",
		"author": "Nick Lane",
		"year-published": 2002,
		"genre": "Popular Science, Chemistry and Biology",
		"review": "While Oxygen was an enjoyable book, its framing and the author's style were strange. Lane seemed to be attempting to convince readers that oxygen is the foremost concern they should have regarding aging and disease. While the arguments and theories he presents are certainly plausible, I did not find myself entirely convinced. He often seemed to be extrapolating into claims he could not defend with solid evidence, though he was rather frank about that fact. While I in no way doubt molecular oxygen's relevance to human health and disease, I do not think I completely believe his ideas and the subsequent weight he gives to its explanatory power. In addition, Lane possessed a strange way of articulating himself, often using odd analogies to present concepts from molecular or evolutionary biology that were distracting and, at times, inappropriate or misconceived. He tried both to reach a common audience, as well as explain detailed information to people with relevant backgrounds. At times, however, it felt as though he was only doing one or the other. However, his historical account of oxygen on Earth was enthralling and incredibly informative. If I revisit the book in the future, I would certainly re-read his history, and perhaps skip the second half of the text."
}

"<b><i>Oxygen</i> by Nick Lane</b><br /><b>Published</b>: 2002<br /><b>Genre</b>: Popular Science, Chemistry and Biology<br /><b>Review</b>: While Oxygen was an enjoyable book, its framing and the author's style were strange. Lane seemed to be attempting to convince readers that oxygen is the foremost concern they should have regarding aging and disease. While the arguments and theories he presents are certainly plausible, I did not find myself entirely convinced. He often seemed to be extrapolating into claims he could not defend with solid evidence, though he was rather frank about that fact. While I in no way doubt molecular oxygen's relevance to human health and disease, I do not think I completely believe his ideas and the subsequent weight he gives to its explanatory power. In addition, Lane possessed a strange way of articulating himself, often using odd analogies to present concepts from molecular or evolutionary biology that were distracting and, at times, inappropriate or misconceived. He tried both to reach a common audience, as well as explain detailed information to people with relevant backgrounds. At times, however, it felt as though he was only doing one or the other. However, his historical account of oxygen on Earth was enthralling and incredibly informative. If I revisit the book in the future, I would certainly re-read his history, and perhaps skip the second half of the text.";