[
	{
		"id": "devilwhitecity",
		"bookname": "Devil in the White City",
		"author": "Erik Larson",
		"year-published": 2003,
		"genre": "History, True Crime",
		"review": "A wonderful book that will leave any Chicagoan with much civic pride. It was incredibly interesting to see how the actions of men more than 100 years ago affect the city today. Absolutely entertaining and Erik Larson's style of writing never ceased to amuse me. He made this historical non-fiction read like a novel."
	},
	{
		"id": "whiteteeth",
		"bookname": "White Teeth",
		"author": "Zadie Smith",
		"year-published": 1999,
		"genre": "Fiction, Novel",
		"review": "Zadie Smith writes an excellent debut novel, with detailed characterizations that succinctly paint her actors. She masterfully interweaves their lives, and allows them to grow in fantastic and sometimes fanatical ways. Definitely include this book on a future."
	},
	{
		"id": "alchemist",
		"bookname": "The Alchemist",
		"author": "Paul Coelho",
		"year-published": 1988,
		"genre": "Fiction",
		"review": "The Alchemist is simultaneously heartwarming and inspiring. Coelho's ideas about the interconnectedness of all things speak to a love for life and its mysteries. Nothing, to him, is unknowable. He also constantly advocates chasing your dreams, and that it is possible to follow your heart and have no need to fear, that it is in fact one's purpose in life to do so. His words are inspiring, and his prose is thoroughly enjoyable."
	},
	{
		"id": "poorec",
		"bookname": "Poor Economics",
		"author": "Esther Duflo and Abhijit Banerjee",
		"year-published": 2011,
		"genre": "Popular Science, Economics",
		"review": "Banerjee and Duflo provide a convincing argument for the notion of evidence-based poverty-fighting techniques. They take a scientific perspective on global poverty. I would have liked to see more statistical evidence, rather simple comparisons of means, as well as more discussion of methods and sample sizes. There is a perception that the softer sciences have a reputation for poor statistical power, and the authors did little to dispel this notion. In addition, there is something that seems somewhat morally off about subjecting groups of individuals in impoverished foreign countries to randomized experiments (in this case, to different external aid “treatments”) without their consent, a concept Banerjee and Duflo never discussed. Nevertheless, they often made convincing arguments about the efficacy of different ideas enacted in the past to fight poverty, and have provided a useful framework through which one can examine the issues discussed."
	},
	{
		"id": "oxygen",
		"bookname": "Oxygen",
		"author": "Nick Lane",
		"year-published": 2002,
		"genre": "Popular Science, Chemistry and Biology",
		"review": "While "Oxygen" was an enjoyable book, its framing and the author's style were strange. Lane seemed to be attempting to convince readers that oxygen is the foremost concern they should have regarding aging and disease. While the arguments and theories he presents are certainly plausible, I did not find myself entirely convinced. He often seemed to be extrapolating into claims he could not defend with solid evidence, though he was rather frank about that fact. While I in no way doubt molecular oxygen's relevance to human health and disease, I do not think I completely believe his ideas and the subsequent weight he gives to its explanatory power. In addition, Lane possessed a strange way of articulating himself, often using odd analogies to present concepts from molecular or evolutionary biology that were distracting and, at times, inappropriate or misconceived. He tried both to reach a common audience, as well as explain detailed information to people with relevant backgrounds. At times, however, it felt as though he was only doing one or the other. However, his historical account of oxygen on Earth was enthralling and incredibly informative. If I revisit the book in the future, I would certainly re-read his history, and perhaps skip the second half of the text."
	}
]